Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata
Represents information about the support and version recommendations for a product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.Lifecycle
Gets the lifecycle status of the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.MinimumVersion
Gets the minimum supported TS product version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.RecommendedVersion
Gets the minimum TS product version that is recommended to access latest features.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.EndOfLife
Gets the end-of-life date of the data product, if available.
End-of-life date refers to the date and time when the data product will be moved.
Only available when lifecycle is "end-of-life".

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.#ctor(System.String,System.Version,System.Version,System.Nullable{System.DateTimeOffset})
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata class.
lifecycle: The lifecycle status of the data product (e.g., production, deprecated, end-of-life).
minimumVersion: The minimum supported Tekla Structures product version.
recommendedVersion: The recommended Tekla Structures product version for accessing the latest features.
endOfLife: The end-of-life date of the data product. Only set when lifecycle is "end-of-life".

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.FromDto(Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.DataProductMetadataDto)
Extracts a Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata instance from the specified Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.DataProductMetadataDto.
dataProductMetadata: The data product metadata DTO to extract information from.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata instance if extraction is successful; otherwise, null.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata.IsTsVersionCompatible(System.String)
Check whether the specified TS version is compatible with the Bim Model data product.
tsVersion: The TS product version to check.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult indicating the compatibility status between the specified TS version and the Bim Model data product.